1)
//какие типы встроенных всплывающих окон в js вы знаете?
//окно предупреждения, окно подтверждения и окно запроса.

2)
//выведите всплывающее окно с предупреждением 'Осторожно'

console.log(window.alert('Осторожно'));

3)
//выведите всплывающее окно с кнопками подтверждения и отмены
console.log(window.confirm('Осторожно'));
4)
//выведите всплывающее окно с вопросом и возможностью записать ответ
console.log(window.prompt('Осторожно'));
5)
//какое временное событие выполняется после ожидания указанного количества миллисекунд?
//setTimeout(function, milliseconds)
6)
//какое временное событие непрерывно повторяет выполнение функции?
//setInterval(function, milliseconds)
7)
//выведите в консоли сообщение 'НАЧАЛО' с помощью setTimeout
console.log(setTimeout("НАЧАЛО", 2000));
8)
//выведите в консоли сообщение 'ПОВТОР' с помощью setInterval каждые 2 секунды
console.log(setInterval("ПОВТОР", 2000));
9)
//что такое куки?
//Файлы cookie позволяют хранить информацию о пользователях на веб-страницах.
10)
//как создать куки файл?
//document.cookie = "username = John Doe"
11)
//как изменить ранее записанный куки?
//path=/
12)
//как удалить ранее записанный куки?
//path=/;